In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
        'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
        'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

In [3]:
df2 = df.copy()

In [4]:
df.gt(df2)

     one    two  three
a  False  False  False
b  False  False  False
c  False  False  False
d  False  False  False

In [5]:
df.ne(df2)

     one    two  three
a  False  False   True
b  False  False  False
c  False  False  False
d   True  False  False

In [6]:
df

        one       two     three
a -0.627327  1.027006       NaN
b -0.314721 -0.602279  0.815712
c  1.165365 -0.547424 -1.794587
d       NaN -0.034354  0.535890

In [7]:
(df > 0).all()

one      False
two      False
three    False
dtype: bool

In [8]:
(df > 0).any()

one      True
two      True
three    True
dtype: bool

In [10]:
(df > 0).any().all()

True

In [15]:
pd.Series([1]).bool()

ValueError: bool cannot act on a non-boolean single element Series

In [12]:
pd.Series([False]).bool()

False

In [13]:
pd.DataFrame([[True]]).bool()

True

In [14]:
pd.DataFrame([[False]]).bool()

False

In [16]:
 pd.Series(['foo', 'bar', 'baz']) == 'foo'

0     True
1    False
2    False
dtype: bool

In [17]:
pd.Series(['foo', 'bar', 'baz']) == pd.Index(['foo', 'bar', 'qux'])

0     True
1     True
2    False
dtype: bool

In [19]:
# pd.Series(['foo', 'bar', 'baz']) == pd.Series(['foo', 'bar'])

In [20]:
(df + df == df * 2).all()

one      False
two       True
three    False
dtype: bool

In [21]:
df + df == df * 2
# Note that the Series or DataFrame index needs to be in the same order for the equality to be True.

     one   two  three
a   True  True  False
b   True  True   True
c   True  True   True
d  False  True   True

In [22]:
df.mean(0)

one      0.074439
two     -0.039263
three   -0.147662
dtype: float64

In [23]:
df.mean(1)

a    0.199840
b   -0.033763
c   -0.392215
d    0.250768
dtype: float64

In [25]:
# like standardization (rendering data zero mean and standard deviation 1
ts_stand = (df - df.mean()) / df.std()

In [26]:
ts_stand

        one       two     three
a -0.732829  1.411413       NaN
b -0.406386 -0.745261  0.672219
c  1.139215 -0.672650 -1.149185
d       NaN  0.006498  0.476966

In [28]:
ts_stand.std()

one      1.0
two      1.0
three    1.0
dtype: float64

In [29]:
series = pd.Series(np.random.randn(1000))

In [30]:
series[::2] = np.nan

In [31]:
series.describe()

count    500.000000
mean      -0.001621
std        1.053607
min       -3.895984
25%       -0.694813
50%        0.000818
75%        0.683154
max        3.837399
dtype: float64

In [32]:
frame = pd.DataFrame(np.random.randn(1000, 5),
               columns=['a', 'b', 'c', 'd', 'e'])

In [33]:
frame.iloc[::2] = np.nan

In [34]:
frame

            a         b         c         d         e
0         NaN       NaN       NaN       NaN       NaN
1   -1.116445 -0.638502 -0.119902  0.110641 -0.527938
2         NaN       NaN       NaN       NaN       NaN
3   -2.124503 -1.001384  1.097197 -0.018118  0.942605
4         NaN       NaN       NaN       NaN       NaN
..        ...       ...       ...       ...       ...
995  0.245478  0.194330  0.398404  0.700738  0.196784
996       NaN       NaN       NaN       NaN       NaN
997 -0.754769  0.679270  1.926521 -1.330892 -0.541964
998       NaN       NaN       NaN       NaN       NaN
999  1.286362  0.464328 -0.418068 -0.403785 -1.223305

[1000 rows x 5 columns]

In [35]:
frame.describe()

                a           b           c           d           e
count  500.000000  500.000000  500.000000  500.000000  500.000000
mean     0.057205   -0.051365   -0.046597    0.016164   -0.021776
std      0.962632    0.991015    1.011639    0.984531    1.040518
min     -3.167552   -2.362489   -2.617881   -3.297387   -2.682031
25%     -0.618456   -0.753123   -0.704716   -0.592073   -0.740158
50%      0.056533   -0.046955   -0.120601   -0.005729   -0.047053
75%      0.680522    0.569426    0.565875    0.625645    0.690169
max      2.833657    3.353976    3.564356    2.711282    3.964245

In [36]:
s = pd.Series(['a', 'a', 'b', 'b', 'a', 'a', np.nan, 'c', 'd', 'a'])

In [37]:
 s.describe()

count     9
unique    4
top       a
freq      5
dtype: object

In [38]:
s1 = pd.Series(np.random.randn(5))

In [39]:
s1

0    0.090473
1    0.259840
2    0.005926
3   -0.155174
4   -0.061379
dtype: float64

In [40]:
s1.idxmin(), s1.idxmax()

(3, 1)

In [41]:
df1 = pd.DataFrame(np.random.randn(5, 3), columns=['A', 'B', 'C'])

In [42]:
df1

          A         B         C
0  0.588044  1.055181  0.846855
1 -0.534521 -0.155403 -0.218779
2 -0.317217 -0.924256  1.939562
3  0.799470  0.939757 -0.261545
4  1.003926 -0.432608  1.097609

In [43]:
df1.idxmin(axis=0)

A    1
B    2
C    3
dtype: int64

In [44]:
df1.idxmax(axis=1)

0    B
1    B
2    C
3    B
4    C
dtype: object

In [45]:
# iterations
df = pd.DataFrame({'col1': np.random.randn(3),
                     'col2': np.random.randn(3)}, index=['a', 'b', 'c'])

In [46]:
# this does not work
for col in df:
    print(col)

col1
col2

In [47]:
df = pd.DataFrame({'a': [1, 2, 3], 'b': ['a', 'b', 'c']})

In [50]:
df

   a  b
0  1  a
1  2  b
2  3  c

In [48]:
for label, ser in df.items():
        print(label)
        print(ser)

a
0    1
1    2
2    3
Name: a, dtype: int64
b
0    a
1    b
2    c
Name: b, dtype: object

In [49]:
for row_index, row in df.iterrows():
        print(row_index, row, sep='\n')

0
a    1
b    a
Name: 0, dtype: object
1
a    2
b    b
Name: 1, dtype: object
2
a    3
b    c
Name: 2, dtype: object

In [51]:
for row in df.itertuples():
        print(row)

Pandas(Index=0, a=1, b='a')
Pandas(Index=1, a=2, b='b')
Pandas(Index=2, a=3, b='c')

# Pandas Viewing

In [52]:
 s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [53]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [54]:
dates = pd.date_range('20130101', periods=6)

In [55]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [56]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [57]:
df

                   A         B         C         D
2013-01-01 -0.442697 -1.003070  1.026539 -0.520009
2013-01-02 -1.315384 -1.522553 -0.716060  0.507310
2013-01-03  2.730327  0.882377 -0.746708 -1.090778
2013-01-04 -0.182278  0.916393 -1.116950 -1.678549
2013-01-05  0.403435  0.323776 -0.683882  0.499144
2013-01-06  0.817248 -1.851113  0.665943 -1.291385

In [66]:
df2 = pd.DataFrame({'A': 1.0,
                       'B': pd.Timestamp('20130102'),
                       'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                       'D': np.array([3] * 4, dtype='int32'),
                       'E': pd.Categorical(["test", "train", "test", "train"]),
                       'F': 'foo'})

TypeError: Cannot interpret '<attribute 'dtype' of 'numpy.generic' objects>' as a data type

In [ ]:
df2.dtypes # view types for each column

df.head() # view top rows of fram
df.tail(3) #view bottom 3 rows of frame

In [67]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [68]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [69]:
df.to_numpy()

array([[-0.4426969 , -1.00307033,  1.02653922, -0.52000931],
       [-1.31538352, -1.52255327, -0.7160602 ,  0.50730982],
       [ 2.73032691,  0.88237723, -0.74670792, -1.09077812],
       [-0.18227833,  0.91639302, -1.11694985, -1.67854924],
       [ 0.40343456,  0.32377614, -0.68388208,  0.4991444 ],
       [ 0.81724756, -1.85111272,  0.66594331, -1.29138507]])

In [70]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.335108 -0.375698 -0.261853 -0.595711
std    1.383546  1.235090  0.879937  0.929805
min   -1.315384 -1.851113 -1.116950 -1.678549
25%   -0.377592 -1.392683 -0.739046 -1.241233
50%    0.110578 -0.339647 -0.699971 -0.805394
75%    0.713794  0.742727  0.328487  0.244356
max    2.730327  0.916393  1.026539  0.507310

In [71]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.442697   -1.315384    2.730327   -0.182278    0.403435    0.817248
B   -1.003070   -1.522553    0.882377    0.916393    0.323776   -1.851113
C    1.026539   -0.716060   -0.746708   -1.116950   -0.683882    0.665943
D   -0.520009    0.507310   -1.090778   -1.678549    0.499144   -1.291385

In [72]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.520009  1.026539 -1.003070 -0.442697
2013-01-02  0.507310 -0.716060 -1.522553 -1.315384
2013-01-03 -1.090778 -0.746708  0.882377  2.730327
2013-01-04 -1.678549 -1.116950  0.916393 -0.182278
2013-01-05  0.499144 -0.683882  0.323776  0.403435
2013-01-06 -1.291385  0.665943 -1.851113  0.817248

In [73]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-06  0.817248 -1.851113  0.665943 -1.291385
2013-01-02 -1.315384 -1.522553 -0.716060  0.507310
2013-01-01 -0.442697 -1.003070  1.026539 -0.520009
2013-01-05  0.403435  0.323776 -0.683882  0.499144
2013-01-03  2.730327  0.882377 -0.746708 -1.090778
2013-01-04 -0.182278  0.916393 -1.116950 -1.678549

# Filtering

In [74]:
 dates = pd.date_range('20130101', periods=6)

In [75]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [109]:
df2 = pd.DataFrame({'A': 1.0,
                      # 'B': pd.Timestamp('20130102'),
                       'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                      'D': np.array([3] * 4, dtype='int32'),
                       'E': pd.Categorical(["test", "train", "test", "train"]),
                       #'F': 'foo'
                   })

TypeError: Cannot interpret '<attribute 'dtype' of 'numpy.generic' objects>' as a data type

In [77]:
# Single col
df['A']

2013-01-01   -0.659839
2013-01-02    1.259443
2013-01-03   -0.218573
2013-01-04   -0.535703
2013-01-05   -0.161058
2013-01-06   -0.569675
Freq: D, Name: A, dtype: float64

In [78]:
df.A

2013-01-01   -0.659839
2013-01-02    1.259443
2013-01-03   -0.218573
2013-01-04   -0.535703
2013-01-05   -0.161058
2013-01-06   -0.569675
Freq: D, Name: A, dtype: float64

In [79]:
# slice
df[0:3]

                   A         B         C         D
2013-01-01 -0.659839  0.815177 -0.413119 -0.269378
2013-01-02  1.259443  0.655261  1.347961  0.057787
2013-01-03 -0.218573 -0.197287 -0.349666  1.174400

In [80]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.259443  0.655261  1.347961  0.057787
2013-01-03 -0.218573 -0.197287 -0.349666  1.174400
2013-01-04 -0.535703  1.857984  0.571367 -1.147072

In [81]:
# index value
df.loc["2013-01-01"]

A   -0.659839
B    0.815177
C   -0.413119
D   -0.269378
Name: 2013-01-01 00:00:00, dtype: float64

In [82]:
# more than 1 column name
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01 -0.659839  0.815177
2013-01-02  1.259443  0.655261
2013-01-03 -0.218573 -0.197287
2013-01-04 -0.535703  1.857984
2013-01-05 -0.161058 -0.447111
2013-01-06 -0.569675 -0.780088

In [83]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  1.259443  0.655261
2013-01-03 -0.218573 -0.197287
2013-01-04 -0.535703  1.857984

In [84]:
# with out rows selection will just return serries
df.loc['20130102', ['A', 'B']]

A    1.259443
B    0.655261
Name: 2013-01-02 00:00:00, dtype: float64

In [85]:
# returns scalar as one element
df.loc[dates[0], 'A']

-0.6598391841644612

In [86]:
# pulls back 3rd row
df.iloc[3]

A   -0.535703
B    1.857984
C    0.571367
D   -1.147072
Name: 2013-01-04 00:00:00, dtype: float64

In [87]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.535703  1.857984
2013-01-05 -0.161058 -0.447111

In [88]:
# take all columns
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  1.259443  0.655261  1.347961  0.057787
2013-01-03 -0.218573 -0.197287 -0.349666  1.174400

In [89]:
# select_dtypes()

In [90]:
df = pd.DataFrame({'string': list('abc'),
                       'int64': list(range(1, 4)),
                       'uint8': np.arange(3, 6).astype('u1'),
                       'float64': np.arange(4.0, 7.0),
                       'bool1': [True, False, True],
                       'bool2': [False, True, False],
                       'dates': pd.date_range('now', periods=3),
                       'category': pd.Series(list("ABC")).astype('category')})

In [92]:
df

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,1,3,4.0,True,False,2021-09-21 10:08:38.533290,A
1,b,2,4,5.0,False,True,2021-09-22 10:08:38.533290,B
2,c,3,5,6.0,True,False,2021-09-23 10:08:38.533290,C

In [91]:
df.select_dtypes(include=[bool])

   bool1  bool2
0   True  False
1  False   True
2   True  False

In [93]:
# Take the rows where index is higher than 0.
df[df['float64'] >= 5]

,string,int64,uint8,float64,bool1,bool2,dates,category
1,b,2,4,5.0,False,True,2021-09-22 10:08:38.533290,B
2,c,3,5,6.0,True,False,2021-09-23 10:08:38.533290,C

In [95]:
df2 = df.copy()

In [96]:
df2

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,1,3,4.0,True,False,2021-09-21 10:08:38.533290,A
1,b,2,4,5.0,False,True,2021-09-22 10:08:38.533290,B
2,c,3,5,6.0,True,False,2021-09-23 10:08:38.533290,C

In [97]:
df2['E'] = ['one', 'two', 'three']

In [98]:
df2

,string,int64,uint8,float64,bool1,bool2,dates,category,E
0,a,1,3,4.0,True,False,2021-09-21 10:08:38.533290,A,one
1,b,2,4,5.0,False,True,2021-09-22 10:08:38.533290,B,two
2,c,3,5,6.0,True,False,2021-09-23 10:08:38.533290,C,three

In [110]:
# picks off rows with one two seen in column E
df2[df2['E'].isin(['one','two'])]

,string,int64,uint8,float64,bool1,bool2,dates,category,E
0,a,1,3,4.0,True,False,2021-09-21 10:08:38.533290,A,one
1,b,2,4,5.0,False,True,2021-09-22 10:08:38.533290,B,two

In [111]:
df.iat[0, 1] = -1

In [112]:
df

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,-1,3,4.0,True,False,2021-09-21 10:08:38.533290,A
1,b,2,4,5.0,False,True,2021-09-22 10:08:38.533290,B
2,c,3,5,6.0,True,False,2021-09-23 10:08:38.533290,C

In [113]:
df.iloc[0, 1] = 2
df

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,2,3,4.0,True,False,2021-09-21 10:08:38.533290,A
1,b,2,4,5.0,False,True,2021-09-22 10:08:38.533290,B
2,c,3,5,6.0,True,False,2021-09-23 10:08:38.533290,C

In [115]:
df.at[0, 'float64'] = -10
df

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,2,3,-10.0,True,False,2021-09-21 10:08:38.533290,A
1,b,2,4,5.0,False,True,2021-09-22 10:08:38.533290,B
2,c,3,5,6.0,True,False,2021-09-23 10:08:38.533290,C

In [117]:
df.loc[0, 'float64'] = -20
df

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,2,3,-20.0,True,False,2021-09-21 10:08:38.533290,A
1,b,2,4,5.0,False,True,2021-09-22 10:08:38.533290,B
2,c,3,5,6.0,True,False,2021-09-23 10:08:38.533290,C

In [118]:
df.loc[:, 'uint8'] = np.array([50] * len(df))
# note lengths need to be equal

In [119]:
df

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,2,50,-20.0,True,False,2021-09-21 10:08:38.533290,A
1,b,2,50,5.0,False,True,2021-09-22 10:08:38.533290,B
2,c,3,50,6.0,True,False,2021-09-23 10:08:38.533290,C

 # Merge

In [120]:
# Concatenating pandas objects together with concat() (equivalent to UNION in SQL)
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  0.003896 -0.501165 -0.688864  0.406897
1 -1.059179 -1.566951  0.878708 -1.013950
2 -1.291322  0.155317  0.513678  0.013955
3  0.784051 -0.523748 -0.815750  0.514828
4 -0.199505 -0.397747  0.343764  1.510256
5 -0.520792  1.160745 -0.516463 -0.415049
6  0.253649  0.240176  1.717192 -0.176086
7 -1.077539 -1.210088 -1.913654 -0.497401
8  1.141206  0.604872  1.503016  1.598943
9 -1.212124  1.718259  1.473041 -0.961119

In [121]:
# break into pieces
pieces = [df[:3], df[3:7], df[7:]]
pd.concat(pieces)

          0         1         2         3
0  0.003896 -0.501165 -0.688864  0.406897
1 -1.059179 -1.566951  0.878708 -1.013950
2 -1.291322  0.155317  0.513678  0.013955
3  0.784051 -0.523748 -0.815750  0.514828
4 -0.199505 -0.397747  0.343764  1.510256
5 -0.520792  1.160745 -0.516463 -0.415049
6  0.253649  0.240176  1.717192 -0.176086
7 -1.077539 -1.210088 -1.913654 -0.497401
8  1.141206  0.604872  1.503016  1.598943
9 -1.212124  1.718259  1.473041 -0.961119

In [122]:
# DataFrame also has a method called .append(). But even though adding a column to a DataFrame is relatively fast,
# adding a row requires a copy, and may be expensive. It's faster to concatenate two data-frames than appending rows.

In [124]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  bar     2

In [126]:
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  bar     5

In [127]:
# Make an inner join between tables created above on column key:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [128]:
# if want to do other joins ( other than inner -use how)
pd.merge(left, right, on='key', how='outer')

   key  lval  rval
0  foo     1     4
1  bar     2     5

# Grouping

In [129]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                             'foo', 'bar', 'foo', 'foo'],
                        'B': ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                       'C': np.random.randn(8),
                       'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.047921  0.215351
1  bar    one -1.705731 -0.761977
2  foo    two -0.618604 -0.739414
3  bar  three -0.507926  0.197335
4  foo    two -0.197979  1.646529
5  bar    two -0.812774  0.137595
6  foo    one  0.665785  1.725682
7  foo  three -2.385221  1.088382

In [130]:
# Group the DataFrame by column A and sum the values of C and D ( in sql - select A
#   ,sum(C) as C
#   ,sum(D) as D
# from df
# group by A;)

In [131]:
df.groupby('A').sum()

            C         D
A
bar -3.026430 -0.427047
foo -2.583939  3.936532

In [132]:
df.groupby(['A', 'B']).sum() # creates multilevel index

                  C         D
A   B
bar one   -1.705731 -0.761977
    three -0.507926  0.197335
    two   -0.812774  0.137595
foo one    0.617864  1.941034
    three -2.385221  1.088382
    two   -0.816582  0.907115

In [133]:
# select A
#   ,sum(C) as C
#   ,max(D) as D
# from df
# group by A;

In [134]:
df.groupby('A').agg({'C': np.sum, 'D': np.max})

            C         D
A
bar -3.026430  0.197335
foo -2.583939  1.725682

  # Stack and pivot

In [135]:
# The stack() method "compresses" a level in the DataFrame's columns

In [137]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                         'foo', 'foo', 'qux', 'qux'],
                        ['one', 'two', 'one', 'two',
                         'one', 'two', 'one', 'two']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [139]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [141]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

                     A         B
first second
bar   one    -0.729804 -0.358238
      two    -1.223311 -2.360984
baz   one    -1.999194 -0.181162
      two     0.670874  1.809971
foo   one    -0.027228 -0.265525
      two    -0.826818  0.695040
qux   one    -0.850465 -0.181297
      two     0.012878  1.071933

In [143]:
df2 = df[:4]
df2

                     A         B
first second
bar   one    -0.729804 -0.358238
      two    -1.223311 -2.360984
baz   one    -1.999194 -0.181162
      two     0.670874  1.809971

In [147]:
# Now, we are going to use the stack() function to "compress" the columns into the index.
stacked = df2.stack()

In [148]:
stacked

first  second
bar    one     A   -0.729804
               B   -0.358238
       two     A   -1.223311
               B   -2.360984
baz    one     A   -1.999194
               B   -0.181162
       two     A    0.670874
               B    1.809971
dtype: float64

In [149]:
type(stacked)

pandas.core.series.Series

In [150]:
stacked.unstack()

                     A         B
first second
bar   one    -0.729804 -0.358238
      two    -1.223311 -2.360984
baz   one    -1.999194 -0.181162
      two     0.670874  1.809971

In [151]:
stacked.unstack(1)

second        one       two
first
bar   A -0.729804 -1.223311
      B -0.358238 -2.360984
baz   A -1.999194  0.670874
      B -0.181162  1.809971

In [152]:
stacked.unstack(0)

first          bar       baz
second
one    A -0.729804 -1.999194
       B -0.358238 -0.181162
two    A -1.223311  0.670874
       B -2.360984  1.809971

# pivot tables

In [155]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                       'B': ['A', 'B', 'C'] * 4,
                       'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                       'D': np.random.randn(12),
                       'E': np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo  1.254897  0.147393
1     one  B  foo -0.130112  0.021621
2     two  C  foo  0.671354 -0.592300
3   three  A  bar -1.752467 -0.378492
4     one  B  bar -0.139383  0.564136
5     one  C  bar -0.155258  1.297985
6     two  A  foo -1.039267 -1.341014
7   three  B  foo  0.542331  0.333486
8     one  C  foo -1.697713 -1.085302
9     one  A  bar -0.582857 -0.037146
10    two  B  bar -0.133507  0.854136
11  three  C  bar -0.464739 -1.786147

In [154]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -1.007672  0.653911
      B  0.669621 -2.058347
      C -0.961937 -0.406493
three A  1.062525       NaN
      B       NaN  0.261953
      C -1.563524       NaN
two   A       NaN  2.337406
      B  0.205884       NaN
      C       NaN -0.705538

# apply

In [156]:
# tablewise function application: pipe()
# row or column-wise function application: apply()

In [157]:
def extract_city_name(df):
     """
     Chicago, IL -> Chicago for city_name column
     """
     df['city_name'] = df['city_and_code'].str.split(",").str.get(0)
     return df

In [158]:
def add_country_name(df, country_name=None):
     """
     Chicago -> Chicago-US for city_name column
     """
     col = 'city_name'
     df['city_and_country'] = df[col] + country_name
     return df

In [160]:
df_p = pd.DataFrame({'city_and_code': ['Chicago, IL']})
df_p

  city_and_code
0   Chicago, IL

In [161]:
add_country_name(extract_city_name(df_p), country_name='US')

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS

In [162]:
#  pipe() for the problem above, which is known as 'method chaining'.

In [163]:
(df_p.pipe(extract_city_name)
         .pipe(add_country_name, country_name="US"))

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS

In [164]:
df = pd.DataFrame({
        'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
        'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})
df

        one       two     three
a -0.384722  1.485513       NaN
b  1.259867 -0.451020  0.967595
c -0.543308  0.282171 -0.769678
d       NaN  0.925436  0.645292

In [165]:
# pre-build numpy function
df.apply(np.mean)

one      0.110612
two      0.560525
three    0.281070
dtype: float64

In [166]:
df.apply(np.mean, axis=1)

a    0.550395
b    0.592147
c   -0.343605
d    0.785364
dtype: float64

In [167]:
df.apply(lambda x: x.max() - x.min())

one      1.803175
two      1.936533
three    1.737273
dtype: float64

In [168]:
df.apply(np.cumsum)

        one       two     three
a -0.384722  1.485513       NaN
b  0.875145  1.034492  0.967595
c  0.331837  1.316664  0.197917
d       NaN  2.242100  0.843209

In [169]:
df.apply(np.exp)

        one       two     three
a  0.680640  4.417230       NaN
b  3.524954  0.636978  2.631609
c  0.580824  1.326006  0.463162
d       NaN  2.522967  1.906544

In [171]:
# Can use apply to apply own function
def own_function(x):
    return x*x

df.apply(own_function)

        one       two     three
a  0.148011  2.206749       NaN
b  1.587266  0.203419  0.936241
c  0.295184  0.079621  0.592404
d       NaN  0.856431  0.416402

In [172]:
# can pass in arguments
def subtract_and_divide(x, sub, divide=1):
    return (x - sub) / divide

In [173]:
df.apply(subtract_and_divide, args=(5,3))

        one       two     three
a -1.794907 -1.171496       NaN
b -1.246711 -1.817007 -1.344135
c -1.847769 -1.572610 -1.923226
d       NaN -1.358188 -1.451569

In [174]:
# args has to be iterable. Therefore, even if you pass only 1 argument, you have to pass it as a tuple:

# args=(5,)
def subtract(x, sub):
    return (x - sub)

df.apply(subtract, args=(5,))

        one       two     three
a -5.384722 -3.514487       NaN
b -3.740133 -5.451020 -4.032405
c -5.543308 -4.717829 -5.769678
d       NaN -4.074564 -4.354708